# BuiltInFailures.CurtainGridFamilyFailures Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..CurtainGridFamilyFailures Class
BuiltInFailures Class Members See Also
---
Failures about CurtainGrid Family.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static class CurtainGridFamilyFailures
```

Visual Basic
---
```text
Public NotInheritable Class CurtainGridFamilyFailures
```

Visual C++
---
```text
public ref class CurtainGridFamilyFailures abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..BuiltInFailures..::..CurtainGridFamilyFailures
# See Also
BuiltInFailures..::..CurtainGridFamilyFailures Members
Autodesk.Revit.DB Namespace